Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-38-42.tmx
Source language: bo
Languages: en

source: དེའི་མོད་ལ་མ་མ་དེ་དགའ་བ་དང་མོས་པའི་ཤུགས་ཆེན་པོ་ཐོབ་པར་གྱུར་ནས། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཡུལ་ཀུན་ཏུ་ལྟ་བ་ཞེས་བྱ་བ་ཐོབ་པར་གྱུར་ཏོ།
en: The instant that she took the bodhisattva onto her lap, the nurse attained great powerful joy and faith and attained the bodhisattva samādhi called all-seeing

source: །དེ་ཐོབ་པར་གྱུར་མ་ཐག་ཏུ་དེས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན་བཞུགས་པའི་དེ་བཞིན་གཤེགས་པ་ཚད་མེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་མཐོང་བར་གྱུར་ཏོ།
en: As soon as she attained that, she saw the countless tathāgatas present within the world realms in the ten directions.

source: །བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བསྐལ་པ་ཚད་མེད་པར་དམྱིགས་པ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བས་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་སྟོན་པ་འདི་ལའང་ཤིན་ཏུ་ཕྲ་བའི་ཚུལ་གྱིས་ཞུགས་པར་གྱུར་ཏེ།
en: She entered in a subtle way this bodhisattva liberation called the miraculous manifestations at the birth of bodhisattvas throughout all the perceptions of countless kalpas

source: དེ་ནི་དཔེར་ན། མའི་མངལ་དུ་ཞུགས་མ་ཐག་པའི་རྣམ་པར་ཤེས་པ་ལྟ་བུའོ། །རྣམ་པར་ཐར་པ་དེ་ཐོབ་པར་གྱུར་པས་ཀྱང་།
en: This was like the moment when a consciousness enters a womb.

source: དེས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ། ཡང་དག་པར་བལྟ་བའི་སྨོན་ལམ་ཆེན་པོ་ཡང་མངོན་པར་བསྒྲུབས་སོ།
en: Through attaining that liberation, she made the great prayer to see the miraculous manifestations at the births of all tathāgatas.

source: དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའི་མ་མ་དྲི་མ་མེད་པས་བསྐྱེད་པའི་འོད་ཅེས་བྱ་བ་བྱུང་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: If you think that the bodhisattva’s nurse, Vimala­saṃbhava­prabhā, at that time, in that time, was anyone else, do not see her in that way.

source: ཁོ་མོ་ནི་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའི་མ་མ་དྲི་མ་མེད་པ་སྐྱེད་པའི་འོད་ཅེས་བྱ་བར་གྱུར་ཏོ།
en: I was at that time, in that time, the bodhisattva’s nurse, Vimala­saṃbhava­prabhā.

source: དེའི་ཚེ་དེའི་དུས་ན་བུད་མྱེད་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་ཉི་ཤུ་བྱུང་བར་གྱུར་པ་དེ་དག་གཞན་དག་ཅིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ཡང་དེ་ལྟར་མི་བལྟ་སྟེ།
en: If you think that the two hundred thousand trillion women at that time, in that time, were anyone else, do not see them in that way.

source: ལྷ་མོ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་ཉི་ཤུ་པོ་ལུམ་བི་ནིའི་ནགས་ཚལ་ན་གནས་པ་ཁོ་མོའི་འཁོར་དུ་གྱུར་པ་འདི་དག་ཡིན་ནོ།
en: They are these two hundred thousand trillion goddesses who now dwell in the Lumbinī Forest and are my entourage.

source: དེའི་ཚེ་དེའི་དུས་ན་དབང་ཕྱུག་གི་ཡོན་ཏན་གཞན་གྱིས་མི་ཐུབ་པའི་རྒྱལ་མཚན་གཞོན་ནུའི་ཡུམ་རབ་ཏུ་དགའ་བའི་འོད་ལ་དབང་བསྒྱུར་བ་ཞེས་བྱ་བ་བྱུང་བ་དེ་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ནའང་དེ་ལྟར་མི་བལྟ་སྟེ།
en: If you think that Queen Suharṣita­prabheśvarā, the mother of the Tathāgata Īśvara­guṇāparājita­dhvaja, at that time, in that time, was anyone else, do not see her in that way.

source: ལྷ་མོ་སྒྱུ་མ་འདི་ནི་དེའི་ཚེ་དེའི་དུས་ན་རབ་ཏུ་དགའ་བའི་འོད་ལ་དབང་བསྒྱུར་བ་ཞེས་བྱ་བའི་ལྷ་མོར་གྱུར་ཏོ།
en: This Māyādevī was at that time, in that time, the queen named Suharṣita­prabheśvarā.

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་རིན་པོ་ཆེའི་འོད་འཕྲོ་བའི་མྱིག་གི་འོད་ཅེས་བྱ་བ་བྱུང་བ་དེ་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ཡང་དེ་ལྟར་མི་བལྟ་སྟེ།
en: If you think that King Ratnārci­netra­prabha at that time, in that time, was anyone else, do not see him in that way.

source: རྒྱལ་པོ་ཟས་གཙང་མ་འདི་ནི་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་རིན་པོ་ཆེ་འོད་འཕྲོ་བའི་མྱིག་གི་འོད་ཅེས་བྱ་བར་གྱུར་ཏོ།
en: King Śuddhodana was at that time, in that time, the king named Ratnārci­netra­prabha.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་ནི་དེ་ཕྱིན་ཅད་དུ་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་རྒྱ་མཚོ་ལ་ལྟ་ཞིང་ཁོང་དུ་ཆུད་པར་བྱེད་པ་དང་། སེམས་ཅན་རྣམ་པར་འདུལ་བའི་ཁྱུ་མཆོག་གི་མཐུས་རྣམ་པར་འཕྲུལ་པ་རྒྱ་མཚོ་ལ་ལྟ་ཞིང་ཁོང་དུ་ཆུད་པར་བྱེད་པ་དང་། སྐད་ཅིག་ཐམས་ཅད་དུ་བྲལ་བར་མ་གྱུར་ཏོ།
en: “Noble one, since that time, in every instant I have never been apart from seeing and comprehending the ocean of miraculous manifestations at the bodhisattva births of the Bhagavat Vairocana or from seeing and comprehending the ocean of the miraculous manifestations of his supremacy in guiding beings.

source: །རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྨོན་ལམ་རྒྱ་མཚོ་འབྱམ་ཀླས་པ་ལས་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་རྒྱ་མཚོ་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཐམས་ཅད་ན་ཡོད་པ་ལ་སེམས་ཀྱི་སྐད་ཅིག་ཐམས་ཅད་དུ་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཐམས་ཅད་ལས་ཡོངས་སུ་འདལ་བའི་ཡེ་ཤེས་ཀྱི་མིག་གིས་ལྟ་ཞིང་ཁོང་དུ་ཆུད་པར་བྱེད་དེ།
en: “Noble one, in every moment of mind, with eyes of knowledge that encompass all atoms, I see and comprehend within all atoms in this world realm of Sahā an ocean of the buddha realms of the tathāgatas, which have appeared from the vast extent of the ocean of prayers made by the Bhagavat Vairocana. I see and comprehend the ocean of the tathāgatas that are in those buddha realms. I also see and comprehend the great ocean of the miraculous manifestations at the bodhisattva births of those tathāgatas.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཏུ་དེ་བཞིན་གཤེགས་པ་བྱུང་བ་རྒྱ་མཚོ་དག་ཀྱང་ལྟ་ཞིང་ཁོང་དུ་ཆུད་པར་བྱེད་ལ་དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་རྒྱ་མཚོ་ཆེན་པོ་དག་ལ་ཡང་ལྟ་ཞིང་ཁོང་དུ་ཆུད་པར་བྱེད་པ་དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་རྒྱ་མཚོ་དང་སེམས་ཅན་རྣམ་པར་གདུལ་བའི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བས། རྣམ་པར་འཕྲུལ་པ་རྒྱ་མཚོ་ཐམས་ཅད་ལའང་། སེམས་ཀྱི་སྐད་ཅིག་ཐམས་ཅད་དུ་ལྟ་ཞིང་ཁོང་དུ་ཆུད་པར་བྱེད་དོ།
en: “In the same way, in every instant of mind I see and comprehend the entire ocean of the miraculous manifestations of the supremacy of guiding beings and the ocean of the miraculous manifestations at the bodhisattva births of all tathāgatas in the ten directions.

source: །ཇི་ལྟར་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་འབྱམ་ཀླས་པ་ཐམས་ཅད་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ལ་འཇུག་པས་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བ་མ་ནོར་བར་མངོན་དུ་གྱུར་ཏེ།
en: “I perceive without error the births of bodhisattvas through comprehending the succession of the entire vast extent of atoms in this world realm of a thousand million worlds, and I comprehend the qualities of the buddhas.

source: སངས་རྒྱས་ཀྱི་ཡོན་ཏན་ལ་ཞུགས་པར་གྱུར་པ་དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་འབྱམ་ཀླས་པ་ཐམས་ཅད་ཀྱི་ཁོངས་སུ་ཆུད་པའི་ཞིང་རྒྱ་མཚོ་ཐམས་ཅད་ལའང་འཇུག་སྟེ།
en: In the same way, I comprehend the entire ocean of realms contained within the entire vast extent of the atoms in countless tens of thousands of quintillions of buddha realms in the ten directions, and I comprehend the vast ocean of buddhas within them.

source: དེ་དག་ཏུའང་སངས་རྒྱས་རྒྱ་མཚོ་ཤིན་ཏུ་ཡངས་པ་ལ་འཇུག་གོ །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་བྱང་ཆུབ་སེམས་དཔར་གྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་འབྱུང་བའི་རྣམ་པར་འཕྲུལ་པ་རྣམས་ཀྱང་མངོན་དུ་གྱུར་པར་ལྟའོ།
en: I also see the perception of the miraculous manifestations at the bodhisattva births of those buddha bhagavats.

source: །དེ་བཞིན་གཤེགས་པར་གྱུར་ནས་ཀྱང་མཆོད་པ་བྱེད་དོ།
en: I make offerings to them when they become tathāgatas.

source: །དེ་བཞིན་གཤེགས་པ་དེ་དག་ལས་ཀྱང་ཆོས་བསྟན་པ་ཉན་ཏོ།
en: I hear the teachings that those tathāgatas give.

source: །ཆོས་ལ་ཡང་གཉེར་བའི་ཆོས་ཀྱི་ནན་ཏན་དུ་བྱེད་དོ།
en: I practice the correct Dharma of their Dharma.”

source: །དེ་ནས་ལུམ་བི་ནིའི་ནགས་ཚལ་གྱི་ལྷ་མོ་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་བཟང་པོས་དགའ་བའི་དཔལ་གྱིས་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བསྐལ་པ་ཚད་མེད་པར་དམྱིགས་པ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བས་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་སྟོན་པ་འདི་གསལ་བར་བསྟན་པའི་ཕྱིར་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ཕྱོགས་བཅུའི་རྣམ་པར་བལྟས་ཏེ། ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: Then at that time, Sutejomaṇḍala­rati­śrī, the goddess of the Lumbinī Forest, in order to teach clearly the bodhisattva liberation called the miraculous manifestations at the birth of bodhisattvas throughout all the perceptions of countless kalpas , through the blessing of the Buddha, gazed into the ten directions and recited these verses: “Son of the jinas, you have shown respect

source: །རིམ་གྲོ་བསྐྱེད་ཅིང་ང་ལ་གང་འདྲི་བ།
en: And have asked a question, so listen to what I have to say.

source: །དེ་དག་བདག་ལས་རྒྱལ་བའི་སྲས་ཉོན་ཅིག །རྒྱལ་བའི་སྤྱོད་ཡུལ་བལྟ་དཀའ་ཞི་བ་སྟེ།
en: The field of activity of the jinas is a peace that is hard to see

source: །རྒྱུ་དང་རྐྱེན་གྱི་ཚུལ་གྱིས་རྣམ་པར་བསྟན།
en: And which is manifested through the ways of causes and conditions. “I remember as many countless kalpas ago

source: །ཞིང་རྣམས་བྱེ་བའི་རྡུལ་ཕྲན་རབ་སྙེད་ཀྱི། །སྔོན་གྱི་བསྐལ་པ་བསམ་གྱིས་མྱི་ཁྱབ་དྲན།
en: As there are atoms in ten million realms,

source: །བསྐལ་པའི་མིང་ནི་སྔ་ཕྱི་མཉམ་ཞེས་བྱ།
en: There was a kalpa that had the name Samāpadyata,

source: །དེ་ལ་རྒྱལ་བ་བྱེ་བ་བརྒྱད་ཅུ་བྱུང་།
en: In which there were eight hundred million jinas.

source: །བསྐལ་བའི་དང་པོར་དེ་བཞིན་གཤེགས་བྱུང་བ།
en: “The first of the kalpa’s tathāgatas to appear

source: །དབང་ཕྱུག་ཡོན་ཏན་མི་ཐུབ་རྒྱལ་མཚན་ནོ། །ནགས་ཚལ་དམ་པ་གསེར་མདོག་མེ་ཏོག་ཏུ།
en: Was Īśvarājita­guṇa­dhvaja.

source: །མགོན་པོ་དེ་འཁྲུངས་དག་གིས་མཐོང་བར་གྱུར།
en: I saw the birth of that lord of beings

source: །མྱིང་དུ་དྲི་མྱེད་སྐྱེད་པའི་འོད་ཅེས་བྱ།
en: In the supreme forest Svarṇa­puṣpa­prabhava.

source: །དེ་ཡི་མ་མ་མཁས་པར་བདག་གྱུར་ཏེ།
en: “I was his wise nurse, Vimala­saṃbhava­prabhā.

source: །བལྟམ་མ་ཐག་ཏུ་གསེར་མདོག་དམ་པའི་འོད།
en: As soon as he was born, there was a supreme golden light,

source: །འཇིག་རྟེན་དབང་པོས་བདག་གི་པང་དུ་བཞག །གང་ཟག་དམ་པ་པང་དུ་བཞག་ཚེ་ཡང་།
en: And the lords of the world placed him on my lap. “When the supreme individual was placed on my lap,

source: །དེ་ཡི་སྤྱི་གཙུག་བལྟ་བར་མི་ནུས་ཏེ།
en: I could not see the top of his inconceivable head.

source: །བསམ་ཡས་དེ་ལ་གཡས་དང་གཡོན་དུ་ཡང་། །བལྟས་ཤིང་མཐའ་རྙེད་མཐོང་བར་མ་གྱུར་ཏོ།
en: Though I looked from the right and the left, I was not able to see where it ended.

source: །མཚན་རབ་བཟང་པོས་དེ་ནི་ཡོངས་སུ་བརྒྱན།
en: “He was adorned with the excellent physical signs,

source: །དྲི་མེད་དེ་སྐུ་བལྟ་ན་རབ་སྡུག་སྟེ།
en: And his body was stainless and beautiful.

source: །རིན་ཆེན་གཟུགས་འདྲ་བདག་གིས་མཐོང་གྱུར་ནས།
en: He was as if made of jewels, and when I saw him

source: །དགའ་བའི་ཤུགས་དྲག་མཚུངས་མྱེད་རྣམ་པར་འཕེལ།
en: An unparalleled powerful joy increased within me.

source: །དེ་ཡི་ཡོན་ཏན་དཔག་ཡས་སེམས་སེམས་ནས།
en: “As I contemplated his measureless qualities,

source: །ཁོ་མོའི་བསོད་ནམས་རྒྱ་མཚོ་དཔག་མེད་འཕེལ།
en: The ocean of my merit increased.

source: །དེ་ཡི་རྣམ་འཕྲུལ་རྒྱ་མཚོ་མཐོང་གྱུར་ནས།
en: When I saw the ocean of his miraculous manifestations,

source: །རྒྱ་ཆེན་བྱང་ཆུབ་སེམས་ཀྱང་སྐྱེས་པར་གྱུར།
en: A vast aspiration for enlightenment arose within me.

source: །རྒྱལ་བའི་ལེགས་པ་རྒྱ་མཚོ་དགའ་སྨོན་ནས།
en: “With joy and faith in the Jina’s ocean of excellences,

source: །སྨོན་ལམ་རྒྱ་མཚོ་བདག་གིས་རབ་ཏུ་བསྐྱེད།
en: I gave rise to an ocean of prayers.

source: །འབྱམ་ཀླས་ཞིང་རྣམས་ཐམས་ཅད་རྣམ་པར་སྦྱངས།
en: The vast extent of all realms was purified,

source: །ངན་སོང་ལམ་རྣམས་ཀུན་ཀྱང་རྣམ་པར་བཟློག །ཞིང་རྣམས་འབྱམ་ཀླས་ཀུན་གྱི་བདེ་གཤེགས་རྣམས།
en: And all paths to lower existences were averted. “I made an ocean of prayers that I would make Countless offerings to future sugatas

source: །མ་བྱོན་བསམ་གྱིས་མི་ཁྱབ་མཆོད་པ་དང་། །སེམས་ཅན་སྡུག་བསྔལ་རྣམ་པར་དགྲོལ་བའི་ཕྱིར། །སྨོན་ལམ་རྒྱ་མཚོ་ཁོ་མོས་བཏབ་པར་གྱུར།
en: Throughout the vast extent of realms And liberate beings from suffering.

source: །མགོན་པོ་དེ་ལས་བདག་གིས་ཆོས་ཐོས་ནས།
en: “I heard the Dharma from that lord

source: །རྣམ་ཐར་དམ་པའི་དཀྱིལ་འཁོར་འདི་ཡང་ཐོབ།
en: And attained the field of this liberation.

source: །བསྐལ་པ་ཞིང་རྣམས་བྱེ་བའི་རྡུལ་སྙེད་དུ།
en: For kalpas as numerous as atoms in ten million realms,

source: །སྤྱད་པ་སྤྱད་དེ་དེ་ཡང་རྣམ་པར་སྦྱངས།
en: I practiced and purified bodhisattva conduct.

source: །དེ་ལ་མགོན་པོ་ཇི་སྙེད་བྱུང་གྱུར་པ།
en: “I have made offerings to however many lords Have appeared without exception.

source: །དེ་དག་མ་ལུས་བདག་གིས་ཀུན་ཀྱང་མཆོད།
en: I became a holder of their teachings,

source: །རྣམ་ཐར་རྒྱ་མཚོ་འདི་ནི་སྦྱོང་བྱེད་ཅིང་།
en: And I purified the ocean of this liberation. “I became a holder of the Dharma wheel

source: །དེ་དག་བསྟན་པ་ཁོ་མོས་ཡོངས་སུ་བཟུང་།
en: Of all the past possessors of the ten strengths,

source: །ཞིང་རྣམས་བྱེ་བའི་རྡུལ་ཕྲན་རབ་སྙེད་ཀྱི། །སྟོབས་བཅུ་མངའ་བ་ཇི་སྙེད་འདས་བྱུང་བ། །དེ་དག་ཆོས་ཀྱི་འཁོར་ལོ་ཁོ་མོས་བཟུང་།
en: As numerous as the atoms in ten million realms,

source: །རྣམ་ཐར་དཀྱིལ་འཁོར་འདི་ཡང་རབ་ཏུ་བསྒོམས།
en: And I have meditated on the field of this liberation. “I see all the vast extent of the surfaces of atoms,

source: །སངས་རྒྱས་ཞིང་གི་རྡུལ་ཕྲན་ཇི་སྙེད་པ།
en: As many atoms as there are in the buddha realms.

source: །རྡུལ་རྩེ་འབྱམ་ཀླས་ཀུན་ལ་རྣམ་པར་མཐོང་། །རྡུལ་ཕྲན་རེ་རེ་ལ་ཡང་རྒྱ་མཚོའི་ཞིང་།
en: In each atom I see the ocean of realms

source: །སྔོན་ཆད་རྒྱལ་བས་སྦྱངས་པ་རབ་ཏུ་མཐོང་།
en: That have been purified in the past by the jinas.

source: །ཞིང་རྣམས་འབྱམ་ཀླས་དེ་དག་ཀུན་ཏུ་ཡང་།
en: “In all that vast extent of realms,

source: །མགོན་པོ་ཐུགས་རྒྱུད་གཅིག་ལ་བསམ་ཡས་པའི།
en: The lords from their one mind

source: །རྣམ་འཕྲུལ་ཡངས་པ་ཡོངས་སུ་སྟོན་མཛད་ཅིང་།
en: Manifest countless miracles,

source: །ནགས་ཚལ་མཆོག་ཏུ་འཁྲུངས་གྱུར་བདག་གིས་མཐོང་།
en: And I see their births in supreme forests.

source: །རྒྱལ་བ་ལ་ལ་ཞིང་རྣམས་ལ་ལ་ན།
en: “There are certain jinas in certain realms

source: །བྱང་ཆུབ་དམ་པར་འཚང་རྒྱ་ཐུགས་དགོངས་ཤིང་།
en: Intending to attain supreme enlightenment,

source: །དགའ་ལྡན་འཇིག་རྟེན་ཉིད་ན་བཞུགས་པ་ཡང་། །ཞིང་རྣམས་བྱེ་བ་བསམ་གྱིས་མི་ཁྱབ་པ།
en: Who though they are residing in the world of Tuṣita

source: །ཞིང་རྣམས་རྒྱ་མཚོའི་དབྱིངས་སུ་རྣམ་འཕྲུལ་པ།
en: Manifest within an ocean of realms. “In countless tens of millions of realms,

source: །ཤིན་ཏུ་ཡངས་པ་སྐྱེ་བའང་བདག་གིས་མཐོང་།
en: I see this vast extent of their births.

source: །ན་ཆུང་དམ་པའི་ཚོགས་ཀྱི་དབུས་བཞུགས་ཤིང་། །མགོན་པོ་ཆོས་རྣམས་སྟོན་པའངདེ་བཞིན་མཐོང་།
en: I see the lords teaching the Dharma While in the center of an assembly of youths. “I see in each instant of mind those heroes

source: །ཞིང་རྣམས་བྱེ་བའི་རྡུལ་ཕྲན་རབ་སྙེད་ཀྱི། །དཔའ་བོ་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ།
en: Who are as numerous as the atoms in ten million realms

source: །མངོན་པར་འབྱུང་ཞིང་ཤིང་རྒྱལ་དྲུང་གཤེགས་དང་། །སངས་རྒྱས་སྤྱོད་ཡུལ་ཡངས་པ་སྟོན་པ་མཐོང་།
en: Leaving home and going to the foot of the king of trees And manifesting the vast field of activity of a buddha.

source: །ཞིང་གཅིག་རྡུལ་ལ་བསམ་གྱིས་མི་ཁྱབ་པར།
en: “They manifest inconceivable numbers of this and that realm,

source: །ཡུལ་རྣམས་གཞན་དང་གཞན་དག་སྟོན་མཛད་པས།
en: Which are as numerous as the atoms in a realm. I see the supreme humans attaining buddhahood

source: །འགྲོ་རྒྱུད་སེམས་ཅན་སྡུག་བསྔལ་སྒྲོལ་མཛད་ཅིང་།
en: And liberating beings in various existences from suffering.

source: །མི་གཙོ་རྣམ་པར་འཚང་རྒྱ་བདག་གིས་མཐོང་།
en: “They turn the unceasing, self-originated,

source: །རྡུལ་ཕྲན་རེ་རེའི་རྩེ་ལ་མི་ཟད་པའི། །རང་འབྱུང་འཁོར་ལོ་རབ་ཏུ་བསྐོར་མཛད་ཅིང་།
en: Supreme wheel of the surface of each atom.

source: །དབྱངས་རྣམས་རྒྱ་མཚོ་མི་ཟད་སྒྲོག་མཛད་པ།
en: Their voices have an unceasing ocean of speech.

source: །ཆོས་སྤྲིན་རྒྱ་ཆེན་ཆར་འབེབས་མཛད་པ་མཐོང་།
en: I see them sending down rain from clouds of Dharma. “In each instant they manifest passing into nirvāṇa

source: །འགྲོ་བ་ཀུན་ལ་རྣམ་པ་དུ་མར་ཡང་།
en: In many different forms for all beings.

source: །སྐད་ཅིག་རེ་རེར་མྱ་ངན་འདས་སྟོན་པ།
en: I see, in a single atom of a realm, buddhas

source: །ཞིང་རྣམས་བྱེ་བའི་རྡུལ་ཕྲན་རབ་སྙེད་ཀྱི། །སངས་རྒྱས་ཞིང་གཅིག་རྡུལ་ལས་བདག་གིས་མཐོང་།
en: As numerous as the atoms in ten million realms.

source: །རྡུལ་གཅིག་བལྟས་ཀྱང་ཞིང་རྣམས་རྒྱ་མཚོ་དང་། །རྒྱལ་བ་འབྱུང་བ་ཇི་སྙེད་ཀུན་ཀྱང་མཐོང་།
en: “Looking at one atom, I see an ocean of realms And all the jinas who appear in them.

source: །ཚེ་རབས་ཀུན་ཏུ་ལུས་མང་ཁྲག་ཁྲིག་གིས།
en: In many hundred billion bodies in my lifetimes,

source: །དེ་དག་མཆོད་པའི་དོན་དུ་ཉེ་བར་ཕྱིན།
en: I have gone to make offerings to them. “There are all the endless existences of beings

source: །ཞིང་ཚུལ་རྒྱ་མཚོ་བསམ་གྱིས་མི་ཁྱབ་པའི། །འགྲོ་རྒྱུད་མི་ཟད་ཇི་སྙེད་ཡོད་པ་ཡི།
en: In the inconceivable ways of the ocean of realms.

source: །འགྲོ་བ་ཀུན་ལ་མངོན་དུ་ཁོ་མོ་ནི།
en: I come before them all and send down

source: །ཆོས་སྤྲིན་ཡངས་པའི་ཆར་ཡང་རབ་ཏུ་འབེབས།
en: A rain from the vast clouds of the Dharma.

source: །རྒྱལ་སྲས་ཁོ་མོས་བསམ་གྱིས་མི་ཁྱབ་པའི།
en: “Son of the jinas, I know this inconceivable

source: །རྣམ་ཐར་དཀྱིལ་འཁོར་དམ་པ་འདི་ཤེས་ཀྱི།
en: Supreme field of liberation, But I could not teach it all

source: །བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བསམ་ཡས་སུ། །ཐམས་ཅད་བསྟན་པ་ཁོ་མོས་ནུས་རེ་སྐན།
en: In countless quintillions of kalpas.

source: །རིགས་ཀྱི་བུ་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བསྐལ་པ་ཚད་མེད་པར་དམྱིགས་པ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བས་རྣམ་པར་འཕྲུལ་བ་ཡོངས་སུ་སྟོན་པ་འདི་ཤེས་པར་ཟད་ན།
en: “Noble one, I know only this bodhisattva liberation called the miraculous manifestations at the birth of bodhisattvas throughout all the perceptions of countless kalpas

source: ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་བསྐལ་པ་ཐམས་ཅད་དུ་ཞུགས་པའི་མངལ་ནས་ཡོངས་སུ་བྱུང་བའི་སེམས་དང་ལྡན་པ།
en: How could I describe the qualities or know the conduct of bodhisattvas who in each instant of mind have the motivation to appear in all kalpas from the wombs they have entered;

source: ཆོས་ཀྱི་ཚུལ་ཐམས་ཅད་ངེས་པར་རྟོགས་པའི་སྐྱེ་བ་རབ་ཏུ་སྟོན་པ།
en: who manifest births that have the definitive understanding of all the ways of the Dharma;

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཆོད་པའི་སྨོན་ལམ་གྱིས་བསམ་པ་ཡོངས་སུ་བསྐྱེད་པ་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱ་བ་ལ་རབ་ཏུ་གཞོལ་བ།
en: who have the aspiration that gives rise to prayers to make offerings to all the tathāgatas; who are dedicated to attaining the complete realization of all the Dharma of the buddhas;

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་རིགས་དང་རྒྱུད་ཀྱི་ལམ་ཡོངས་སུ་བསྟན་པ་ལ་གཟུགས་བརྙན་ལྟ་བུར་གྱུར་པ།
en: who manifest like reflections within the classes and existences of all beings;

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་དུ་པདྨོའི་ནང་ནས་སྐྱེ་བ་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བའི་དུས་ལ་མཁས་པ།
en: who are born from lotuses at the feet of all the tathāgatas; who are skilled in knowing when the time has come to ripen all beings;

source: སེམས་ཅན་ཐམས་ཅད་གདུལ་བ་ལ་མངོན་པར་མོས་ཤིང་ཚེར་སྐྱེ་བས་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་སྟོན་པ།
en: who manifest the miracle of taking rebirth with the intention to guide all beings;

source: ཞིང་འབྱམ་ཀླས་པ་ཐམས་ཅད་དུ་རྣམ་པར་འཕྲུལ་པའི་སྤྲིན་ཡོངས་སུ་སྟོན་པ།
en: who manifest clouds of miracles throughout the entire vast extent of realms;

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་ལམ་གྱི་རྒྱུད་དུ་སྐྱེ་བ་དང་། རིགས་སུ་གཟུགས་བརྙན་བྱུང་བར་གྱུར་པ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: and who appear as reflections in all the classes of births and existences of all beings?

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན།
en: “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་གྲོང་ཁྱེར་ཆེན་པོ་སེར་སྐྱའི་གནས་འདི་ན་ཤཱཀྱའི་བུ་མོ་གོ་བ་ཞེས་བྱ་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ།
en: In the great city of Kapilavastu there is the Śākya maiden called Gopā.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སེམས་ཅན་ཡོངས་སུ་སྨྱིན་པར་བྱ་བའི་ཕྱིར།
en: Go to her and ask her, ‘How should a bodhisattva continue in saṃsāra in order to ripen beings?’

source: འཁོར་བ་ན་འཁོར་བར་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ལུམ་བི་ནིའི་ནགས་ཚལ་གྱི་ལྷ་མོ་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་བཟང་པོས་དགའ་བའི་དཔལ་གྱི་རྐང་བ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ལུམ་བི་ནིའི་ནགས་ཚལ་གྱི་ལྷ་མོ་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་བཟང་པོས་དགའ་བའི་དཔལ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། །ལུམ་བི་ནིའི་ནགས་ཚལ་གྱི་ལྷ་མོ་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་བཟང་པོས་དགའ་བའི་དཔལ་གྱི་དྲུང་ནས་སོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །བམ་པོ་བཅུ་བཞི་བ།
en: Sudhana, the head merchant’s son, bowed his head to the two feet of Sutejomaṇḍala­rati­śrī, the Lumbinī Forest goddess, circumambulated Sutejomaṇḍala­rati­śrī, the Lumbinī Forest goddess, many hundreds of thousands of times, keeping her to his right, and, with palms together, looking back at her, departed from Sutejomaṇḍala­rati­śrī, the Lumbinī Forest goddess.
